load-generator/test120s1peak.yml
config:
  http:
    timeout: 120

  phases:
    - arrivalRate: 0.2
      duration: 30
    - arrivalRate: 0.4
      duration: 30
    - arrivalRate: 0.6
      duration: 30
    - arrivalRate: 0.8
      duration: 30
    - arrivalRate: 1
      duration: 180
    - arrivalRate: 0.8
      duration: 30
    - arrivalRate: 0.6
      duration: 30
    - arrivalRate: 0.4
      duration: 30
    - arrivalRate: 0.2
      duration: 30
    - arrivalRate: 0.1
      duration: 480

  processor: "./metrics.js"
scenarios:
  - flow:
      - get:
          url: "/function/primality"
          beforeRequest: "beforeRequest"
          afterResponse: "afterResponse"