load-generator/test30s5peak.yml
config:
  http:
    timeout: 120

  phases:
    - arrivalRate: 1
      duration: 7.5
    - arrivalRate: 2
      duration: 7.5
    - arrivalRate: 3
      duration: 7.5
    - arrivalRate: 4
      duration: 7.5
    - arrivalRate: 5
      duration: 180
    - arrivalRate: 4
      duration: 7.5
    - arrivalRate: 3
      duration: 7.5
    - arrivalRate: 2
      duration: 7.5
    - arrivalRate: 1
      duration: 7.5
    - arrivalRate: 0.1
      duration: 480

  processor: "./metrics.js"
scenarios:
  - flow:
      - get:
          url: "/function/primality"
          beforeRequest: "beforeRequest"
          afterResponse: "afterResponse"